#include<iostream>

using namespace std; 

int main(){
    int rows = 5 ; // строки динамического двумерного массива
    int cols = 5; //колонки двумерного динамического массива 
    int **arr = new int*[rows];  //объявление двумерного динамического массива 

    for(int i = 0; i<rows; i++){
        arr[i] = new int [cols];
    }
for(int i = 0; i<rows; i++){            //заполнение динамического массива данными 
    for(int j = 0; j<cols; j++){

        arr[i][j]=rand()%20;        //вызов rand для генерации чисел в пределах 20 

    }
}
///////////////////////////////////////////////////////////////////////////////////////////////////////
for(int i = 0; i<rows; i++){            //вывод динамического массива
    
    for(int j = 0; j<cols; j++){

       cout<<arr[i][j]<<"\t";

    }
    cout<<endl;
}
///////////////////////////////////////////////////////////////////////////////////////////////////////
    for (int i = 0; i<rows; i++){

        delete [] arr[i];           //удаленние данных внутри динамического массива 
    }
    delete [] arr;          

    return 0;
}
